In [1]:
import pandas as pd
import numpy as np

# series

In [2]:
my_dict = {"james":50, "lars":60, "kirk":55, "rob":65}

In [3]:
pd.Series(my_dict)

james    50
lars     60
kirk     55
rob      65
dtype: int64

In [4]:
age_list = [50,60,55,65]
name_list = ["james","lars","kirk","rob"]

In [5]:
pd.Series(age_list,name_list)

james    50
lars     60
kirk     55
rob      65
dtype: int64

In [6]:
pd.Series(data = age_list, index = name_list)

james    50
lars     60
kirk     55
rob      65
dtype: int64

In [7]:
numpy_array = np.array([10,20,30,40])

In [8]:
pd.Series(numpy_array)

0    10
1    20
2    30
3    40
dtype: int32

In [9]:
name_list #normal liste

['james', 'lars', 'kirk', 'rob']

In [10]:
numpy_array #numpy listesi

array([10, 20, 30, 40])

In [11]:
pd.Series(data= numpy_array, index= name_list)

james    10
lars     20
kirk     30
rob      40
dtype: int32

In [12]:
my_series = pd.Series(data= numpy_array,index= name_list)

In [13]:
my_series

james    10
lars     20
kirk     30
rob      40
dtype: int32

In [14]:
type(my_series)

pandas.core.series.Series

In [15]:
my_series["kirk"]

30

In [16]:
my_series["kirk"]=60

In [17]:
my_series

james    10
lars     20
kirk     60
rob      40
dtype: int32

In [18]:
quiz_result_1 = pd.Series(data = [70,60,100], index = ["A","B","C"])

In [19]:
quiz_result_2 = pd.Series(data = [80,30,50], index = ["A","B","C"])

In [20]:
quiz_result_1 + quiz_result_2

A    150
B     90
C    150
dtype: int64

In [21]:
exam_result_1 = pd.Series(data =[70,60,100], index = ["A","B","C"])

In [22]:
exam_resul_2 = pd.Series(data = [80,30,50], index = ["A","D","C"])

In [23]:
exam_result_1 + exam_resul_2

A    150.0
B      NaN
C    150.0
D      NaN
dtype: float64

In [24]:
#new example

In [25]:
my_data = np.array([[10,20,30],[20,30,40],[20,50,10],[10,15,20]])

In [26]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [27]:
my_names = ["james","lars","kirk","rob"]

In [28]:
my_columns = ["jan","feb","mar"]

In [29]:
my_data_frame = pd.DataFrame(my_data)

In [30]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [31]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [32]:
my_data_frame[1]

0    20
1    30
2    50
3    15
Name: 1, dtype: int32

In [33]:
new_data_frame = pd.DataFrame(my_data, index = my_names,columns = my_columns)

In [34]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [35]:
new_data_frame["feb"]

james    20
lars     30
kirk     50
rob      15
Name: feb, dtype: int32

In [36]:
type(new_data_frame["feb"])

pandas.core.series.Series

In [37]:
feb_series = new_data_frame["feb"]

In [38]:
feb_series.mean()

28.75

In [39]:
feb_series

james    20
lars     30
kirk     50
rob      15
Name: feb, dtype: int32

In [40]:
feb_series.lars

30

In [41]:
feb_series.rob

15

In [42]:
new_data_frame[["jan","feb"]]

       jan  feb
james   10   20
lars    20   30
kirk    20   50
rob     10   15

In [43]:
new_data_frame.loc["lars"]

jan    20
feb    30
mar    40
Name: lars, dtype: int32

In [44]:
type(new_data_frame.loc["lars"])

pandas.core.series.Series

In [45]:
new_data_frame.iloc[3]

jan    10
feb    15
mar    20
Name: rob, dtype: int32

In [46]:
new_data_frame["apr"] = new_data_frame["mar"] *2

In [47]:
new_data_frame

       jan  feb  mar  apr
james   10   20   30   60
lars    20   30   40   80
kirk    20   50   10   20
rob     10   15   20   40

In [48]:
new_data_frame.drop("rob",axis=0) #o row 1 rob

       jan  feb  mar  apr
james   10   20   30   60
lars    20   30   40   80
kirk    20   50   10   20

In [49]:
new_data_frame

       jan  feb  mar  apr
james   10   20   30   60
lars    20   30   40   80
kirk    20   50   10   20
rob     10   15   20   40

In [50]:
new_data_frame.drop("apr",axis=1)

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [51]:
new_data_frame

       jan  feb  mar  apr
james   10   20   30   60
lars    20   30   40   80
kirk    20   50   10   20
rob     10   15   20   40

In [52]:
new_data_frame.drop("apr",axis=1,inplace=True)

In [53]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [54]:
new_data_frame["jan"]["lars"]

20

In [55]:
new_data_frame["mar"]["james"]

30

In [56]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [57]:
boolean_frame = new_data_frame > 25

In [58]:
boolean_frame

         jan    feb    mar
james  False  False   True
lars   False   True   True
kirk   False   True  False
rob    False  False  False

In [59]:
new_data_frame[boolean_frame]

       jan   feb   mar
james  NaN   NaN  30.0
lars   NaN  30.0  40.0
kirk   NaN  50.0   NaN
rob    NaN   NaN   NaN

In [60]:
new_data_frame[new_data_frame>30]

       jan   feb   mar
james  NaN   NaN   NaN
lars   NaN   NaN  40.0
kirk   NaN  50.0   NaN
rob    NaN   NaN   NaN

In [61]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [62]:
new_data_frame[new_data_frame["mar"]>25]

       jan  feb  mar
james   10   20   30
lars    20   30   40

In [63]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [64]:
new_data_frame.reset_index()

   index  jan  feb  mar
0  james   10   20   30
1   lars   20   30   40
2   kirk   20   50   10
3    rob   10   15   20

In [65]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [66]:
new_data_frame["newindex"] = ["jam","lar","kir","robert"]

In [67]:
new_data_frame.set_index("newindex")

          jan  feb  mar
newindex
jam        10   20   30
lar        20   30   40
kir        20   50   10
robert     10   15   20

In [68]:
new_data_frame

       jan  feb  mar newindex
james   10   20   30      jam
lars    20   30   40      lar
kirk    20   50   10      kir
rob     10   15   20   robert

In [69]:
new_data_frame.drop("newindex",axis=1,inplace=True)

In [70]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [71]:
#new example

In [72]:
yr_dict = {"james": [40,30,np.nan,], "kirk": [20,np.nan,50], "lars": [30,50,40]}

In [73]:
yr_data_frame = pd.DataFrame(yr_dict)

In [74]:
yr_data_frame

   james  kirk  lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [75]:
yr_data_frame.dropna()

   james  kirk  lars
0   40.0  20.0    30

In [76]:
yr_data_frame

   james  kirk  lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [77]:
yr_data_frame.dropna(axis=1)

   lars
0    30
1    50
2    40

In [78]:
your_dict = {"james": [40,30,np.nan], "kirk": [20,np.nan,50], "lars": [30,50,40], "rob": [45,np.nan,np.nan]}

In [79]:
yr_data_frame = pd.DataFrame(your_dict)

In [80]:
yr_data_frame

   james  kirk  lars   rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [81]:
yr_data_frame.dropna(axis =1,thresh=2)

   james  kirk  lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [82]:
yr_data_frame

   james  kirk  lars   rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [83]:
yr_data_frame.fillna(20) #not aniable :na

   james  kirk  lars   rob
0   40.0  20.0    30  45.0
1   30.0  20.0    50  20.0
2   20.0  50.0    40  20.0

In [84]:
salary_dict = {"programming language": ["python","python","python","swift","java","java"], "name": ["A","B","C","D","E","F"], "salary": [100,90,80,70,60,50]}

In [85]:
salary_frame = pd.DataFrame(salary_dict)

In [86]:
salary_frame

  programming language name  salary
0               python    A     100
1               python    B      90
2               python    C      80
3                swift    D      70
4                 java    E      60
5                 java    F      50

In [87]:
group_object = salary_frame.groupby("programming language")

In [88]:
group_object.count()

                      name  salary
programming language
java                     2       2
python                   3       3
swift                    1       1

In [89]:
group_object.mean()

C:\Users\umk54\AppData\Local\Temp\ipykernel_22248\3749447628.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group_object.mean()

                      salary
programming language
java                    55.0
python                  90.0
swift                   70.0

In [90]:
group_object.min() #salary de min harflerden alfabetik srada en nce gelen

                     name  salary
programming language
java                    E      50
python                  A      80
swift                   D      70

In [91]:
group_object.max()

                     name  salary
programming language
java                    F      60
python                  C     100
swift                   D      70

In [92]:
group_object.min("salary")

                      salary
programming language
java                      50
python                    80
swift                     70

In [93]:
help(group_object.min)

Help on method min in module pandas.core.groupby.groupby:

min(numeric_only: 'bool' = False, min_count: 'int' = -1, engine: 'str | None' = None, engine_kwargs: 'dict[str, bool] | None' = None) method of pandas.core.groupby.generic.DataFrameGroupBy instance
    Compute min of group values.

    Parameters
    ----------
    numeric_only : bool, default False
        Include only float, int, boolean columns. If None, will attempt to use
        everything, then use only numeric data.
    min_count : int, default -1
        The required number of valid values to perform the operation. If fewer
        than ``min_count`` non-NA values are present the result will be NA.

    Returns
    -------
    Series or DataFrame
        Computed min of values within each group.

In [94]:
group_object.min(numeric_only=True)

                      salary
programming language
java                      50
python                    80
swift                     70

In [95]:
group_object.describe()

                     salary
                      count  mean        std   min   25%   50%   75%    max
programming language
java                    2.0  55.0   7.071068  50.0  52.5  55.0  57.5   60.0
python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
swift                   1.0  70.0        NaN  70.0  70.0  70.0  70.0   70.0

In [96]:
my_dict1 = {"name": ["A","B","C","D"], "sports":["basketball","football","tennis","running"], "calories": [100,200,300,400]}

In [97]:
my_frame1 = pd.DataFrame(my_dict1, index= [1,2,3,4])

In [98]:
my_frame1

  name      sports  calories
1    A  basketball       100
2    B    football       200
3    C      tennis       300
4    D     running       400

In [99]:
my_dict2 = {"name": ["E","F","G","H"], "sports":["basketball","football","tennis","running"], "calories": [200,50,330,440]}

In [100]:
my_frame2 = pd.DataFrame(my_dict2, index=[5,6,7,8])

In [101]:
my_frame2

  name      sports  calories
5    E  basketball       200
6    F    football        50
7    G      tennis       330
8    H     running       440

In [102]:
my_dict3 = {"name": ["I","J","K","L"], "sports":["basketball","football","tennis","running"], "calories": [300,150,320,410]}

In [103]:
my_frame3 = pd.DataFrame(my_dict3, index= [9,10,11,12])

In [104]:
my_frame3

   name      sports  calories
9     I  basketball       300
10    J    football       150
11    K      tennis       320
12    L     running       410

# concatenation

In [105]:
pd.concat([my_frame1,my_frame2,my_frame3])

   name      sports  calories
1     A  basketball       100
2     B    football       200
3     C      tennis       300
4     D     running       400
5     E  basketball       200
6     F    football        50
7     G      tennis       330
8     H     running       440
9     I  basketball       300
10    J    football       150
11    K      tennis       320
12    L     running       410

# merge

In [106]:
pd.merge(my_frame1,my_frame2, on= "sports") #iki veri ile

  name_x      sports  calories_x name_y  calories_y
0      A  basketball         100      E         200
1      B    football         200      F          50
2      C      tennis         300      G         330
3      D     running         400      H         440

In [107]:
new_salary_frame = pd.DataFrame({"name": ["james","kirk","lars"], "salary": [10,20,30], "age": [60,65,70]})

In [108]:
new_salary_frame

    name  salary  age
0  james      10   60
1   kirk      20   65
2   lars      30   70

In [109]:
new_salary_frame["name"].unique()

array(['james', 'kirk', 'lars'], dtype=object)

In [110]:
new_salary_frame["name"].nunique()

3

In [111]:
def grossToNet(salary):
    return salary * 0.65

In [112]:
new_salary_frame["salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: salary, dtype: float64